Revit 2027 API
ParameterTypeId.MepSpotTopElevation Property
 "Spot Top Elevation": used for both design and fabrication components
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepSpotTopElevation { get; }
Public Shared ReadOnly Property MepSpotTopElevation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepSpotTopElevation {
	ForgeTypeId^ get ();
}
static member MepSpotTopElevation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace